## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10744405486)



<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer
* Update
  * google_service_account.sa_gke_kyma_integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "image_syncer_prod_repo_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main"
      + project    = (known after apply)
      + repository = "prod"
      + role       = "roles/artifactregistry.createOnPushWriter"
    }

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_keys_cleaner                        = {
      ~ service_account_keys_cleaner_cloud_run_service = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "915ecc2d-b9a5-4f6c-8495-be3608722b1c" -> "c9e63063-1ede-45eb-abfd-06a6e21a6373"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 70 -> 71
                  ~ resource_version      = "AAYhY+z14ME" -> "AAYheMAMszA"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-cleaner"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-cleaner-00070-cj6" -> "service-account-keys-cleaner-00071-bvm"
                  ~ latest_ready_revision_name   = "service-account-keys-cleaner-00070-cj6" -> "service-account-keys-cleaner-00071-bvm"
                  ~ observed_generation          = 70 -> 71
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-cleaner-00070-cj6" -> "service-account-keys-cleaner-00071-bvm"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                        = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "11ad9dfc-9328-4c4d-b86f-f10b8ccc3a9d" -> "06797142-a179-47c6-9364-4f6e682b47d5"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 69 -> 70
                  ~ resource_version      = "AAYhY+z9r2c" -> "AAYheMAhhqk"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-rotator"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-rotator-00069-kwc" -> "service-account-keys-rotator-00070-c97"
                  ~ latest_ready_revision_name   = "service-account-keys-rotator-00069-kwc" -> "service-account-keys-rotator-00070-c97"
                  ~ observed_generation          = 69 -> 70
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-rotator-00069-kwc" -> "service-account-keys-rotator-00070-c97"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11818,"Program":"tfcmt","SHA1":"6ee34198695b60a57a17578ce7e678887f0d2907","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->